app/serializers/trip_serializer.rb

SELECT "locations".* FROM "locations" INNER JOIN "attractions" ON "locations"."id" = "attractions"."location_id" INNER JOIN "visits" ON "attractions"."id" = "visits"."attraction_id" WHERE "visits"."trip_id" = ?  [["trip_id", 1]]
---
  attributes :name, :start_date, :end_date

  attribute :locations do |trip|
    trip.locations.map do |loc|