app/controllers/api/v1/attractions_controller.rb

  def index
    @attractions = Attraction.all
---
SELECT "attractions".* FROM "attractions"

    def set_attraction
      @attraction = Attraction.find(params[:id])
---
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]