app/controllers/api/v1/trips_controller.rb

INSERT INTO "trips" ("name", "start_date", "end_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lancaster County"], ["start_date", "2022-08-18"], ["end_date", "2022-08-21"], ["user_id", 1], ["created_at", "2022-04-18 18:39:06.105230"], ["updated_at", "2022-04-18 18:39:06.105230"]]
---
  def create
    # byebug
    @trip = current_user.trips.build(trip_params)

    if @trip.save

UPDATE "trips" SET "name" = ?, "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["name", "Boston"], ["start_date", "2022-05-26"], ["end_date", "2022-05-29"], ["updated_at", "2022-04-18 18:25:31.551760"], ["id", 3]]
---
  def update
    if @trip.update(trip_params)

DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 2]]
---
  def destroy
    if @trip.destroy