app/controllers/api/v1/users_controller.rb

INSERT INTO "locations" ("city", "state", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "New York"], ["state", "New York"], ["country", "USA"], ["created_at", "2022-03-24 00:43:06.256542"], ["updated_at", "2022-03-24 00:43:06.256542"]]
INSERT INTO "users" ("name", "username", "password_digest", "hometown_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "locations".* FROM "locations" WHERE "locations"."city" = ? AND "locations"."state" = ? AND "locations"."country" = ? LIMIT ?  [["city", "New York"], ["state", "New York"], ["country", "USA"], ["LIMIT", 1]]
---
  def create
    @user = User.new(user_params)
    @location =  Location.find_or_create_by(
      city: params[:user][:hometown][:city],
      state: params[:user][:hometown][:state],
      country: params[:user][:hometown][:country])

    @user.hometown = @location
    if @user.save